Repository: flaskcwg/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/deploying/index.po
Languages: es

source: Deploying to Production
es: Despliegue en producción

source: After developing your application, you'll want to make it available publicly to other users. When you're developing locally, you're probably using the built-in development server, debugger, and reloader. These should not be used in production. Instead, you should use a dedicated WSGI server or hosting platform, some of which will be described here.
es: Después de desarrollar tu aplicación, querrás hacerla disponible públicamente para otros usuarios. Cuando estás desarrollando localmente, probablemente estés usando el servidor de desarrollo, el depurador y el recargador incorporados. Estos no deben ser utilizados en producción. En su lugar, deberías utilizar un servidor WSGI dedicado o una plataforma de alojamiento, algunos de los cuales se describirán aquí.

source: "Production" means "not development", which applies whether you're serving your application publicly to millions of users or privately / locally to a single user. **Do not use the development server when deploying to production. It is intended for use only during local development. It is not designed to be particularly secure, stable, or efficient.**
es: "Producción" significa "no desarrollo", lo que se aplica tanto si estás sirviendo tu aplicación de forma pública a millones de usuarios como de forma privada / local a un solo usuario. **No utilice el servidor de desarrollo cuando se despliega a la producción. Está destinado a ser utilizado sólo durante el desarrollo local. No está diseñado para ser particularmente seguro, estable o eficiente.**

source: Self-Hosted Options
es: Opciones de autoalojamiento

source: Flask is a WSGI *application*. A WSGI *server* is used to run the application, converting incoming HTTP requests to the standard WSGI environ, and converting outgoing WSGI responses to HTTP responses.
es: Flask es una *aplicación* WSGI. Se utiliza un *servidor* WSGI para ejecutar la aplicación, convirtiendo las peticiones HTTP entrantes en el entorno WSGI estándar, y convirtiendo las respuestas WSGI salientes en respuestas HTTP.

source: The primary goal of these docs is to familiarize you with the concepts involved in running a WSGI application using a production WSGI server and HTTP server. There are many WSGI servers and HTTP servers, with many configuration possibilities. The pages below discuss the most common servers, and show the basics of running each one. The next section discusses platforms that can manage this for you.
es: El objetivo principal de estos documentos es familiarizarte con los conceptos involucrados en la ejecución de una aplicación WSGI utilizando un servidor WSGI de producción y un servidor HTTP. Hay muchos servidores WSGI y servidores HTTP, con muchas posibilidades de configuración. Las páginas siguientes discuten los servidores más comunes, y muestran los fundamentos de la ejecución de cada uno. La siguiente sección discute las plataformas que pueden gestionar esto por ti.

source: WSGI servers have HTTP servers built-in. However, a dedicated HTTP server may be safer, more efficient, or more capable. Putting an HTTP server in front of the WSGI server is called a "reverse proxy."
es: Los servidores WSGI tienen servidores HTTP incorporados. Sin embargo, un servidor HTTP dedicado puede ser más seguro, más eficiente o más capaz. Poner un servidor HTTP delante del servidor WSGI se llama "proxy inverso".

source: This list is not exhaustive, and you should evaluate these and other servers based on your application's needs. Different servers will have different capabilities, configuration, and support.
es: Esta lista no es exhaustiva, y debe evaluar estos y otros servidores en función de las necesidades de su aplicación. Los diferentes servidores tendrán diferentes capacidades, configuración y soporte.

source: Hosting Platforms
es: Plataformas de alojamiento

source: There are many services available for hosting web applications without needing to maintain your own server, networking, domain, etc. Some services may have a free tier up to a certain time or bandwidth. Many of these services use one of the WSGI servers described above, or a similar interface. The links below are for some of the most common platforms, which have instructions for Flask, WSGI, or Python.
es: Hay muchos servicios disponibles para alojar aplicaciones web sin necesidad de mantener tu propio servidor, red, dominio, etc. Algunos servicios pueden tener un nivel gratuito hasta un determinado tiempo o ancho de banda. Muchos de estos servicios utilizan uno de los servidores WSGI descritos anteriormente, o una interfaz similar. Los enlaces de abajo son para algunas de las plataformas más comunes, que tienen instrucciones para Flask, WSGI, o Python.

source: This list is not exhaustive, and you should evaluate these and other services based on your application's needs. Different services will have different capabilities, configuration, pricing, and support.
es: Esta lista no es exhaustiva y debe evaluar estos y otros servicios en función de las necesidades de su aplicación. Los diferentes servicios tendrán diferentes capacidades, configuraciones, precios y soporte.

source: You'll probably need to :doc:`proxy_fix` when using most hosting platforms.
es: Probablemente necesitará :doc:`proxy_fix` cuando utilice la mayoría de las plataformas de alojamiento.
