Repository: flaskcwg/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/installation.po
Languages: es

source: Installation
es: Instalación

source: Python Version
es: Versión de Python

source: We recommend using the latest version of Python. Flask supports Python 3.8 and newer.
es: Recomendamos utilizar la última versión de Python. Flask es compatible con Python 3.8 y versiones posteriores.

source: Dependencies
es: Dependencias

source: These distributions will be installed automatically when installing Flask.
es: Estas distribuciones se instalarán automáticamente al instalar Flask.

source: `Werkzeug`_ implements WSGI, the standard Python interface between applications and servers.
es: `Werkzeug`_ implementa WSGI, la interfaz estándar de Python entre aplicaciones y servidores.

source: `Jinja`_ is a template language that renders the pages your application serves.
es: `Jinja`_ es un lenguaje de plantillas que renderiza las páginas que sirve tu aplicación.

source: `MarkupSafe`_ comes with Jinja. It escapes untrusted input when rendering templates to avoid injection attacks.
es: `MarkupSafe`_ viene con Jinja. Escapa de la entrada no fiable cuando se renderizan las plantillas para evitar ataques de inyección.

source: `ItsDangerous`_ securely signs data to ensure its integrity. This is used to protect Flask's session cookie.
es: `ItsDangerous`_ firma de forma segura los datos para asegurar su integridad. Se utiliza para proteger la cookie de sesión de Flask.

source: `Click`_ is a framework for writing command line applications. It provides the ``flask`` command and allows adding custom management commands.
es: `Click`_ es un marco para escribir aplicaciones de línea de comandos. Proporciona el comando ``flask`` y permite añadir comandos de gestión personalizados.

source: `Blinker`_ provides support for :doc:`signals`.
es: `Blinker`_ proporciona soporte para :doc:`signals`.

source: Optional dependencies
es: Dependencias opcionales

source: These distributions will not be installed automatically. Flask will detect and use them if you install them.
es: Estas distribuciones no se instalarán automáticamente. Flask las detectará y utilizará si usted las instala.

source: `python-dotenv`_ enables support for :ref:`dotenv` when running ``flask`` commands.
es: `python-dotenv`_ habilita el soporte para :ref:`dotenv` cuando se ejecutan comandos ``flask``.

source: `Watchdog`_ provides a faster, more efficient reloader for the development server.
es: `Watchdog`_ proporciona un recargador más rápido y eficiente para el servidor de de desarrollo.

source: You may choose to use gevent or eventlet with your application. In this case, greenlet>=1.0 is required. When using PyPy, PyPy>=7.3.7 is required.
es: Puede elegir utilizar gevent o eventlet con su aplicación. En este caso, se requiere greenlet>=1.0. Cuando se utiliza PyPy, se requiere PyPy>=7.3.7.

source: These are not minimum supported versions, they only indicate the first versions that added necessary features. You should use the latest versions of each.
es: Estas no son versiones mínimas soportadas, sólo indican las primeras versiones que añadieron características necesarias. Debe utilizar las últimas versiones de cada una de ellas.

source: Virtual environments
es: Entornos virtuales

source: Use a virtual environment to manage the dependencies for your project, both in development and in production.
es: Utilice un entorno virtual para gestionar las dependencias de su proyecto, tanto en desarrollo como en producción.

source: What problem does a virtual environment solve? The more Python projects you have, the more likely it is that you need to work with different versions of Python libraries, or even Python itself. Newer versions of libraries for one project can break compatibility in another project.
es: ¿Qué problema resuelve un entorno virtual? Cuantos más proyectos de Python tengas, más probable es que necesites trabajar con diferentes versiones de librerías de Python, o incluso con el propio Python. Las nuevas versiones de las librerías para un proyecto pueden romper la compatibilidad en otro proyecto.

source: Virtual environments are independent groups of Python libraries, one for each project. Packages installed for one project will not affect other projects or the operating system's packages.
es: Los entornos virtuales son grupos independientes de bibliotecas Python, uno para cada proyecto. Los paquetes instalados para un proyecto no afectarán a otros proyectos o a los paquetes del sistema operativo.

source: Python comes bundled with the :mod:`venv` module to create virtual environments.
es: Python viene con el módulo :mod:`venv` para crear entornos virtuales.

source: Create an environment
es: Crear un entorno

source: Create a project folder and a :file:`.venv` folder within:
es: Crea una carpeta de proyecto y dentro una carpeta :file:`.venv`:

source: Activate the environment
es: Activar el entorno

source: Before you work on your project, activate the corresponding environment:
es: Antes de trabajar en su proyecto, active el entorno correspondiente:

source: Your shell prompt will change to show the name of the activated environment.
es: El prompt del shell cambiará para mostrar el nombre del entorno activado.

source: Install Flask
es: Instalar Flask

source: Within the activated environment, use the following command to install Flask:
es: Dentro del entorno activado, utilice el siguiente comando para instalar Flask:

source: Flask is now installed. Check out the :doc:`/quickstart` or go to the :doc:`Documentation Overview </index>`.
es: Flask ya está instalado. Consulta el :doc:`/quickstart` o ve al :doc:`Resumen de la documentación </index>`.
