Repository: flaskcwg/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/server.po
Languages: es

source: Development Server
es: Servidor de desarrollo

source: Flask provides a ``run`` command to run the application with a development server. In debug mode, this server provides an interactive debugger and will reload when code is changed.
es: Flask proporciona un comando ``run`` para ejecutar la aplicación con un servidor de desarrollo. En modo depuración, este servidor proporciona un depurador interactivo y se recargará cuando se modifique el código.

source: Do not use the development server when deploying to production. It is intended for use only during local development. It is not designed to be particularly efficient, stable, or secure.
es: No utilice el servidor de desarrollo cuando lo despliegue en producción. Está pensado para ser utilizado sólo durante el desarrollo local. No está diseñado para ser particularmente eficiente, estable o seguro.

source: See :doc:`/deploying/index` for deployment options.
es: Ver :doc:`/deploying/index` para las opciones de despliegue.

source: Command Line
es: Línea de comandos

source: The ``flask run`` CLI command is the recommended way to run the development server. Use the ``--app`` option to point to your application, and the ``--debug`` option to enable debug mode.
es: El comando CLI ``flask run`` es la forma recomendada para ejecutar el servidor de desarrollo. Utilice la opción ``--app`` para apuntar a su aplicación, y la opción ``--debug`` para activar el modo de depuración.

source: This enables debug mode, including the interactive debugger and reloader, and then starts the server on http://localhost:5000/. Use ``flask run --help`` to see the available options, and :doc:`/cli` for detailed instructions about configuring and using the CLI.
es: Esto habilita el modo de depuración, incluyendo el depurador interactivo y el reloader, y luego inicia el servidor en http://localhost:5000/. Utilice ``flask run --help`` para ver las opciones disponibles, y :doc:`/cli` para obtener instrucciones detalladas sobre la configuración y el uso de la CLI.

source: Address already in use
es: Dirección ya utilizada

source: If another program is already using port 5000, you'll see an ``OSError`` when the server tries to start. It may have one of the following messages:
es: Si otro programa ya está utilizando el puerto 5000, verá un ``OSError`` cuando el servidor intente iniciarse. Puede tener uno de los siguientes mensajes:

source: Either identify and stop the other program, or use ``flask run --port 5001`` to pick a different port.
es: Identifique y detenga el otro programa, o utilice ``flask run --port 5001`` para elegir un puerto diferente.

source: You can use ``netstat`` or ``lsof`` to identify what process id is using a port, then use other operating system tools stop that process. The following example shows that process id 6847 is using port 5000.
es: Puedes usar ``netstat`` o ``lsof`` para identificar qué id de proceso está usando un puerto, y luego usar otras herramientas del sistema operativo para detener ese proceso. El siguiente ejemplo muestra que el proceso 6847 está usando el puerto 5000.

source: macOS Monterey and later automatically starts a service that uses port 5000. To disable the service, go to System Preferences, Sharing, and disable "AirPlay Receiver".
es: macOS Monterey y posteriores inician automáticamente un servicio que utiliza el puerto 5000. Para desactivar el servicio, vaya a Preferencias del Sistema, Compartir, y desactive "AirPlay Receiver".

source: Deferred Errors on Reload
es: Errores diferidos en la recarga

source: When using the ``flask run`` command with the reloader, the server will continue to run even if you introduce syntax errors or other initialization errors into the code. Accessing the site will show the interactive debugger for the error, rather than crashing the server.
es: Al utilizar el comando ``flask run`` con el reloader, el servidor continuará ejecutándose aunque introduzcas errores de sintaxis u otros errores de inicialización en el código. Al acceder al sitio se mostrará el depurador interactivo para el error, en lugar de bloquear el servidor.

source: If a syntax error is already present when calling ``flask run``, it will fail immediately and show the traceback rather than waiting until the site is accessed. This is intended to make errors more visible initially while still allowing the server to handle errors on reload.
es: Si hay un error de sintaxis cuando se llama a ``flask run``, fallará inmediatamente y mostrará el rastro en lugar de esperar hasta que se acceda al sitio. Esto pretende hacer que los errores sean más visibles al principio, al tiempo que permite al servidor manejar los errores en la recarga.

source: In Code
es: En Código

source: The development server can also be started from Python with the :meth:`Flask.run` method. This method takes arguments similar to the CLI options to control the server. The main difference from the CLI command is that the server will crash if there are errors when reloading. ``debug=True`` can be passed to enable debug mode.
es: El servidor de desarrollo también puede ser inicializado desde Python con el método :meth: `Flask.run`. Este método toma argumentos similares a las opciones de CLI para controlar el servidor. La principal diferencia con el comando CLI es que el servidor fallará si hay errores al recargar. Se puede pasar ``debug=True`` para habilitar el modo de depuración.

source: Place the call in a main block, otherwise it will interfere when trying to import and run the application with a production server later.
es: Coloque la llamada en un bloque principal, de lo contrario interferirá al intentar importar y ejecutar la aplicación con un servidor de producción más tarde.
