Repository: flaskcwg/flask-docs-es
Catalog: docs/locales/*/LC_MESSAGES/tutorial/deploy.po
Languages: es

source: Deploy to Production
es: Despliegue en producción

source: This part of the tutorial assumes you have a server that you want to deploy your application to. It gives an overview of how to create the distribution file and install it, but won't go into specifics about what server or software to use. You can set up a new environment on your development computer to try out the instructions below, but probably shouldn't use it for hosting a real public application. See :doc:`/deploying/index` for a list of many different ways to host your application.
es: Esta parte del tutorial asume que tienes un servidor en el que quieres desplegar tu aplicación. Da una visión general de cómo crear el archivo de distribución e instalarlo, pero no entra en detalles sobre qué servidor o software utilizar. Puedes configurar un nuevo entorno en tu ordenador de desarrollo para probar las instrucciones de abajo, pero probablemente no deberías usarlo para alojar una aplicación pública real. Vea :doc:`/deploying/index` para una lista de diferentes maneras de alojar su aplicación.

source: Build and Install
es: Construir e instalar

source: You can find the file in ``dist/flaskr-1.0.0-py3-none-any.whl``. The file name is in the format of {project name}-{version}-{python tag} -{abi tag}-{platform tag}.
es: Puedes encontrar el archivo en ``dist/flaskr-1.0.0-py3-none-any.whl``. El nombre del archivo tiene el formato de {nombre del proyecto}-{version}-{etiqueta python} -{etiqueta abi}-{etiqueta de plataforma}.

source: Copy this file to another machine, :ref:`set up a new virtualenv <install-create-env>`, then install the file with ``pip``.
es: Copie este archivo a otra máquina, :ref:`configure un nuevo virtualenv <install-create-env>`, luego instale el archivo con ``pip``.

source: Pip will install your project along with its dependencies.
es: Pip instalará su proyecto junto con sus dependencias.

source: Since this is a different machine, you need to run ``init-db`` again to create the database in the instance folder.
es: Como se trata de una máquina diferente, es necesario ejecutar ``init-db`` de nuevo para crear la base de datos en la carpeta de la instancia.

source: When Flask detects that it's installed (not in editable mode), it uses a different directory for the instance folder. You can find it at ``.venv/var/flaskr-instance`` instead.
es: Cuando Flask detecta que está instalado (no en modo edición), utiliza un directorio diferente para la carpeta de la instancia. Puedes encontrarla en ``.venv/var/flaskr-instance`` en su lugar.

source: Configure the Secret Key
es: Configurar la clave secreta

source: In the beginning of the tutorial that you gave a default value for :data:`SECRET_KEY`. This should be changed to some random bytes in production. Otherwise, attackers could use the public ``'dev'`` key to modify the session cookie, or anything else that uses the secret key.
es: Al principio del tutorial que dio un valor por defecto para :data:`SECRET_KEY`. Esto debería ser cambiado por algunos bytes aleatorios en producción. De lo contrario, los atacantes podrían utilizar la clave pública ``'dev'`` para modificar la cookie de sesión, o cualquier otra cosa que utilice la clave secreta.

source: You can use the following command to output a random secret key:
es: Puede utilizar el siguiente comando para obtener una clave secreta aleatoria:

source: Create the ``config.py`` file in the instance folder, which the factory will read from if it exists. Copy the generated value into it.
es: Crea el archivo ``config.py`` en la carpeta de la instancia, que la fábrica leerá si existe. Copie el valor generado en él.

source: You can also set any other necessary configuration here, although ``SECRET_KEY`` is the only one needed for Flaskr.
es: También puedes establecer aquí cualquier otra configuración necesaria, aunque ``SECRET_KEY`` es la única necesaria para Flaskr.

source: Run with a Production Server
es: Ejecutar con un servidor de producción

source: When running publicly rather than in development, you should not use the built-in development server (``flask run``). The development server is provided by Werkzeug for convenience, but is not designed to be particularly efficient, stable, or secure.
es: Cuando se ejecuta públicamente y no en desarrollo, no se debe utilizar el servidor de desarrollo incorporado (``flask run``). El servidor de desarrollo es proporcionado por Werkzeug por conveniencia, pero no está diseñado para ser particularmente eficiente, estable o seguro.

source: Instead, use a production WSGI server. For example, to use `Waitress`_, first install it in the virtual environment:
es: En su lugar, utilice un servidor WSGI de producción. Por ejemplo, para usar `Waitress`_, primero instálalo en el entorno virtual:

source: You need to tell Waitress about your application, but it doesn't use ``--app`` like ``flask run`` does. You need to tell it to import and call the application factory to get an application object.
es: Necesitas decirle a Waitress sobre tu aplicación, pero no utiliza ``--app`` como lo hace ``flask run``. Tienes que decirle que importe y llame a la fábrica de aplicaciones para obtener un objeto de aplicación.

source: See :doc:`/deploying/index` for a list of many different ways to host your application. Waitress is just an example, chosen for the tutorial because it supports both Windows and Linux. There are many more WSGI servers and deployment options that you may choose for your project.
es: Consulte :doc:`/deploying/index` para ver una lista de las diferentes formas de alojar su aplicación. Waitress es sólo un ejemplo, elegido para el tutorial porque soporta tanto Windows como Linux. Hay muchos más servidores WSGI y opciones de despliegue que puedes elegir para tu proyecto.

source: Continue to :doc:`next`.
es: Continuar con :doc:`next`.
